# Clear Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..Clear Method
TessellatedShapeBuilder Class See Also
---
Erases all face set and clears the logs, if any.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void Clear()
```

Visual Basic
---
```text
Public Sub Clear
```

Visual C++
---
```text
public:
void Clear()
```

# Remarks
This function can be safely called upon builder without an open face set.
# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace